RailsClient/app/views/locations/index.html.erb

SELECT `locations`.* FROM `locations`
---
        <!--<td>-->
          <!--<%= location.order_source_location.name if location.order_source_location %>-->