RailsClient/app/views/deliveries/index.html.erb

SELECT `deliveries`.* FROM `deliveries`
---
        发送地：
        <%= select_tag('delivery[source_location_id]', options_from_collection_for_select(Location.all, 'id', 'name', @delivery_source_location_id), include_blank: true) %>