RailsClient/app/controllers/locations_controller.rb

  def index
    @locations = Location.paginate(:page => params[:page]) #all
---
SELECT `locations`.* FROM `locations`